title: Potential Access Remote PC RMM Tool File Activity
id: 22def60f-6814-4b8e-a2e9-a7df7a763171
status: experimental
description: |
    Detects potential files activity of Access Remote PC RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: file_event
detection:
    selection:
        TargetFilename|endswith:
            - "C:\Program Files (x86)\RemotePC\RemotePCUIU.exe"
            - "C:\Program Files (x86)\RemotePC\*"
    condition: selection
falsepositives:
    - Legitimate use of Access Remote PC
level: medium
