title: Potential Action1 RMM Tool File Activity
id: 31837e4c-8573-4185-8438-2a8c31d93ad9
status: experimental
description: |
    Detects potential files activity of Action1 RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: file_event
detection:
    selection:
        TargetFilename|endswith:
            - "C:\Windows\Action1\action1_agent.exe"
            - "C:\Windows\Action1\*"
            - "C:\Windows\Action1\scripts\*"
            - "C:\Windows\Action1\rule_data\*"
            - "C:\Windows\Action1\action1_log_*.log"
    condition: selection
falsepositives:
    - Legitimate use of Action1
level: medium
