title: Potential Action1 RMM Tool Registry Activity
id: d4eb9645-5856-4b05-b113-6fa32b5e84b2
status: experimental
description: |
    Detects potential registry activity of Action1 RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: registry_event
detection:
    selection:
        TargetObject|contains:
            - "HKLM\System\CurrentControlSet\Services\A1Agent"
            - "HKLM\SOFTWARE\WOW6432Node\Microsoft\Windows\Windows Error Reporting\LocalDumps\action1_agent.exe"
            - "HKLM\SOFTWARE\WOW6432Node\Action1"
    condition: selection
falsepositives:
    - Legitimate use of Action1
level: medium
