title: Potential AeroAdmin RMM Tool Network Activity
id: 2221b9c9-acf5-4fc4-8702-1208d34927f2
status: experimental
description: |
    Detects potential network activity of AeroAdmin RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: network_connection
detection:
    selection:
        DestinationHostname|endswith:
            - "auth*.aeroadmin.com"
            - "aeroadmin.com"
    condition: selection
falsepositives:
    - Legitimate use of AeroAdmin
level: medium
