title: Potential AliWangWang-remote-control RMM Tool Network Activity
id: 3b171c13-ce06-4a13-a310-85a3d6a44b24
status: experimental
description: |
    Detects potential network activity of AliWangWang-remote-control RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: network_connection
detection:
    selection:
        DestinationHostname|endswith: "wangwang.taobao.com"
    condition: selection
falsepositives:
    - Legitimate use of AliWangWang-remote-control
level: medium
