title: Potential Alpemix RMM Tool File Activity
id: 9f341a6b-0e00-47c1-91ff-45c14fb2cc64
status: experimental
description: |
    Detects potential files activity of Alpemix RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: file_event
detection:
    selection:
        TargetFilename|endswith: "%localappdata%\Alpemix\Alpemix.ini"
    condition: selection
falsepositives:
    - Legitimate use of Alpemix
level: medium
