title: Potential Alpemix RMM Tool Registry Activity
id: 702f82b3-fad1-483a-b07b-a988319e440b
status: experimental
description: |
    Detects potential registry activity of Alpemix RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: registry_event
detection:
    selection:
        TargetObject|contains: "HKLM\SYSTEM\CurrentControlSet\Services\AlpemixSrvcx"
    condition: selection
falsepositives:
    - Legitimate use of Alpemix
level: medium
