title: Potential Ammyy Admin RMM Tool File Activity
id: cce6aeea-db94-4984-93f0-e12bb6eb68c4
status: experimental
description: |
    Detects potential files activity of Ammyy Admin RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: file_event
detection:
    selection:
        TargetFilename|endswith:
            - "%programdata%\\AMMYY\\access.log"
            - "%Binary_path%\\AA_v3.log"
    condition: selection
falsepositives:
    - Legitimate use of Ammyy Admin
level: medium
