title: Potential Ammyy Admin RMM Tool Registry Activity
id: 0e5ec518-0868-40d7-839f-79d018de1b6d
status: experimental
description: |
    Detects potential registry activity of Ammyy Admin RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: registry_event
detection:
    selection:
        TargetObject|contains:
            - "HKU\.DEFAULT\Software\Ammyy\Admin"
            - "HKLM\SYSTEM\ControlSet001\Control\SafeBoot\Network\AmmyyAdmin"
    condition: selection
falsepositives:
    - Legitimate use of Ammyy Admin
level: medium
