title: Potential Ammyy Admin RMM Tool Process Activity
id: 426c67ac-cea9-4e98-ae05-63e3225936cf
status: experimental
description: |
    Detects potential processes activity of Ammyy Admin RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: process_creation
detection:
    selection_parent:
        ParentImage|endswith:
            - "AMMYY_Admin.exe"
            - "aa_v*.exe"
            - "C:\Users\*\Downloads\AMMYY_Admin.exe"
            - "*\AMMYY_Admin.exe"
    selection_image:
        Image|endswith:
            - "AMMYY_Admin.exe"
            - "aa_v*.exe"
            - "C:\Users\*\Downloads\AMMYY_Admin.exe"
            - "*\AMMYY_Admin.exe"
    condition: 1 of selection_*
falsepositives:
    - Legitimate use of Ammyy Admin
level: medium
