title: Potential Aspia RMM Tool File Activity
id: 850d85b6-4393-4a5d-8c0e-9c6de8257129
status: experimental
description: |
    Detects potential files activity of Aspia RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: file_event
detection:
    selection:
        TargetFilename|endswith:
            - "C:\Users\*\AppData\Roaming\aspia\client.ini"
            - "C:\Users\*\AppData\Local\Temp\aspia\aspia_client-*.log"
            - "C:\Program Files\Aspia\Client\qt.conf"
    condition: selection
falsepositives:
    - Legitimate use of Aspia
level: medium
