title: Potential Atera RMM Tool Network Activity
id: 6e97753a-9f8c-425c-b3bf-c71d0a56b432
status: experimental
description: |
    Detects potential network activity of Atera RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: network_connection
detection:
    selection:
        DestinationHostname|endswith:
            - "pubsub.atera.com"
            - "pubsub.pubnub.com"
            - "agentreporting.atera.com"
            - "getalphacontrol.com"
            - "app.atera.com"
            - "agenthb.atera.com"
            - "packagesstore.blob.core.windows.net"
            - "ps.pndsn.com"
            - "agent-api.atera.com"
            - "agentreportingstore.blob.core.windows.net"
            - "atera-agent-heartbeat.servicebus.windows.net"
            - "ps.atera.com"
            - "atera.pubnubapi.com"
            - "appcdn.atera.com"
    condition: selection
falsepositives:
    - Legitimate use of Atera
level: medium
