title: Potential Atera RMM Tool File Activity
id: e408190a-d11e-40a8-997c-612c888198d9
status: experimental
description: |
    Detects potential files activity of Atera RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: file_event
detection:
    selection:
        TargetFilename|endswith:
            - "C:\Program Files\ATERA Networks\AteraAgent\Packages\AgentPackageRunCommandInteractive\log.txt"
            - "C:\Program Files\ATERA Networks\AteraAgent\Packages\*"
            - "C:\Program Files\ATERA Networks\AteraAgent\AteraAgent.exe"
            - "C:\Program Files\Atera Networks\AlphaAgent.exe"
            - "C:\Program Files\ATERA Networks\AteraAgent\Packages\AgentPackageSTRemote\AgentPackageSTRemote.exe"
            - "C:\Program Files\ATERA Networks\AteraAgent\Packages\AgentPackageMonitoring\AgentPackageMonitoring.exe"
            - "C:\Program Files\ATERA Networks\AteraAgent\Packages\AgentPackageHeartbeat\AgentPackageHeartbeat.exe"
            - "C:\Program Files\ATERA Networks\AteraAgent\Packages\AgentPackageFileExplorer\AgentPackageFileExplorer.exe"
            - "C:\Program Files\ATERA Networks\AteraAgent\Packages\AgentPackageRunCommandInteractive\AgentPackageRunCommandInteractive.exe"
    condition: selection
falsepositives:
    - Legitimate use of Atera
level: medium
