title: Potential BeamYourScreen RMM Tool Network Activity
id: bc17025e-2273-4ed4-bf5d-e9b1052d37e8
status: experimental
description: |
    Detects potential network activity of BeamYourScreen RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: network_connection
detection:
    selection:
        DestinationHostname|endswith:
            - "beamyourscreen.com"
            - "*.beamyourscreen.com"
    condition: selection
falsepositives:
    - Legitimate use of BeamYourScreen
level: medium
