title: Potential BeInSync RMM Tool Process Activity
id: 924a72a6-80fc-46f6-8903-2ab3ce6aac8a
status: experimental
description: |
    Detects potential processes activity of BeInSync RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: process_creation
detection:
    selection_parent:
        ParentImage|endswith: "Beinsync*.exe"
    selection_image:
        Image|endswith: "Beinsync*.exe"
    condition: 1 of selection_*
falsepositives:
    - Legitimate use of BeInSync
level: medium
