title: Potential Connectwise Automate (LabTech) RMM Tool Network Activity
id: 28bfa936-79db-4af7-911e-00fd3bbe11d5
status: experimental
description: |
    Detects potential network activity of Connectwise Automate (LabTech) RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: network_connection
detection:
    selection:
        DestinationHostname|endswith: "*.hostedrmm.com"
    condition: selection
falsepositives:
    - Legitimate use of Connectwise Automate (LabTech)
level: medium
