title: Potential Connectwise Automate (LabTech) RMM Tool Process Activity
id: 8a93bd52-f714-48c9-accf-e890eba505c7
status: experimental
description: |
    Detects potential processes activity of Connectwise Automate (LabTech) RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: process_creation
detection:
    selection_parent:
        ParentImage|endswith:
            - "ltsvc.exe"
            - "ltsvcmon.exe"
            - "lttray.exe"
    selection_image:
        Image|endswith:
            - "ltsvc.exe"
            - "ltsvcmon.exe"
            - "lttray.exe"
    condition: 1 of selection_*
falsepositives:
    - Legitimate use of Connectwise Automate (LabTech)
level: medium
