title: Potential Devolutions Remote Desktop Manager RMM Tool File Activity
id: 58767cd5-8d7e-40e0-b90f-6452522faa1e
status: experimental
description: |
    Detects potential files activity of Devolutions Remote Desktop Manager RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: file_event
detection:
    selection:
        TargetFilename|endswith:
            - "%localappdata%\Devolutions\RemoteDesktopManager\Connections.log"
            - "%localappdata%\Devolutions\RemoteDesktopManager[GUID]\Mru.xml"
            - "%localappdata%\Devolutions\RemoteDesktopManager\Connections.db"
    condition: selection
falsepositives:
    - Legitimate use of Devolutions Remote Desktop Manager
level: medium
