title: Potential Domotz RMM Tool Process Activity
id: 98e2fb0c-90b3-40f5-a316-ca43e0666396
status: experimental
description: |
    Detects potential processes activity of Domotz RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: process_creation
detection:
    selection_parent:
        ParentImage|endswith:
            - "domotz.exe"
            - "Domotz Pro Desktop App.exe"
            - "domotz_bash.exe"
            - "domotz*.exe"
            - "Domotz Pro Desktop App Setup*.exe"
            - "domotz-windows*.exe"
    selection_image:
        Image|endswith:
            - "domotz.exe"
            - "Domotz Pro Desktop App.exe"
            - "domotz_bash.exe"
            - "domotz*.exe"
            - "Domotz Pro Desktop App Setup*.exe"
            - "domotz-windows*.exe"
    condition: 1 of selection_*
falsepositives:
    - Legitimate use of Domotz
level: medium
