title: Potential Duplicati RMM Tool Process Activity
id: 70f3fc1b-6f4e-4003-bae2-7a257b3b2db1
status: experimental
description: |
    Detects potential processes activity of Duplicati RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: process_creation
detection:
    selection_parent:
        ParentImage|endswith:
            - "c:\Program Files\*\Duplicati.Server.exe"
            - "*\*\Duplicati.Server.exe"
    selection_image:
        Image|endswith:
            - "c:\Program Files\*\Duplicati.Server.exe"
            - "*\*\Duplicati.Server.exe"
    condition: 1 of selection_*
falsepositives:
    - Legitimate use of Duplicati
level: medium
