title: Potential Ericom Connect RMM Tool Process Activity
id: 1abbee7a-4072-48ee-a560-b1837157b788
status: experimental
description: |
    Detects potential processes activity of Ericom Connect RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: process_creation
detection:
    selection_parent:
        ParentImage|endswith:
            - "EricomConnectRemoteHost*.exe"
            - "ericomconnnectconfigurationtool.exe"
    selection_image:
        Image|endswith:
            - "EricomConnectRemoteHost*.exe"
            - "ericomconnnectconfigurationtool.exe"
    condition: 1 of selection_*
falsepositives:
    - Legitimate use of Ericom Connect
level: medium
