title: Potential ExtraPuTTY RMM Tool Process Activity
id: 0eba988c-5794-440c-9c14-c7354fd0d648
status: experimental
description: |
    Detects potential processes activity of ExtraPuTTY RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: process_creation
detection:
    selection_parent:
        ParentImage|endswith:
            - "C:\Users\*\ExtraPuTTY-0.30-2016-01-28-installer.exe"
            - "*Users\*\ExtraPuTTY-0.30-2016-01-28-installer.exe"
            - "*\ExtraPuTTY-0.30-2016-01-28-installer.exe"
    selection_image:
        Image|endswith:
            - "C:\Users\*\ExtraPuTTY-0.30-2016-01-28-installer.exe"
            - "*Users\*\ExtraPuTTY-0.30-2016-01-28-installer.exe"
            - "*\ExtraPuTTY-0.30-2016-01-28-installer.exe"
    condition: 1 of selection_*
falsepositives:
    - Legitimate use of ExtraPuTTY
level: medium
