title: Potential FleetDeck.io RMM Tool Registry Activity
id: 64e7643c-e2ea-497d-9e08-edc92c25bb1c
status: experimental
description: |
    Detects potential registry activity of FleetDeck.io RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: registry_event
detection:
    selection:
        TargetObject|contains: "HKLM\SYSTEM\CurrentControlSet\Services\FleetDeck Agent Service"
    condition: selection
falsepositives:
    - Legitimate use of FleetDeck.io
level: medium
