title: Potential FleetDeck.io RMM Tool Process Activity
id: d8b814b5-45b7-41ff-803d-a27bce29873c
status: experimental
description: |
    Detects potential processes activity of FleetDeck.io RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: process_creation
detection:
    selection_parent:
        ParentImage|endswith:
            - "C:\Program Files (x86)\FleetDeck Agent\fleetdeck_agent_svc.exe"
            - "C:\Program Files (x86)\FleetDeck Agent\*\fleetdeck_agent.exe"
            - "fleetdeck-agent.exe"
            - "fleetdeck_agent_svc.exe"
            - "fleetdeck_commander_svc.exe"
            - "fleetdeck_installer.exe"
            - "fleetdeck_commander_launcher.exe"
            - "fleetdeck_agent.exe"
    selection_image:
        Image|endswith:
            - "C:\Program Files (x86)\FleetDeck Agent\fleetdeck_agent_svc.exe"
            - "C:\Program Files (x86)\FleetDeck Agent\*\fleetdeck_agent.exe"
            - "fleetdeck-agent.exe"
            - "fleetdeck_agent_svc.exe"
            - "fleetdeck_commander_svc.exe"
            - "fleetdeck_installer.exe"
            - "fleetdeck_commander_launcher.exe"
            - "fleetdeck_agent.exe"
    condition: 1 of selection_*
falsepositives:
    - Legitimate use of FleetDeck.io
level: medium
