title: Potential GetScreen RMM Tool Network Activity
id: c0417b29-972e-4488-8fdc-c00033f9e402
status: experimental
description: |
    Detects potential network activity of GetScreen RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: network_connection
detection:
    selection:
        DestinationHostname|endswith:
            - "getscreen.me"
            - "GetScreen.me"
            - "*.getscreen.me"
    condition: selection
falsepositives:
    - Legitimate use of GetScreen
level: medium
