title: Potential GoToMyPC RMM Tool File Activity
id: 51cfa613-68d8-4d9c-bda6-99cc5eb7b7d8
status: experimental
description: |
    Detects potential files activity of GoToMyPC RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: file_event
detection:
    selection:
        TargetFilename|endswith: "%AppData%\GoTo\Logs\goto.log"
    condition: selection
falsepositives:
    - Legitimate use of GoToMyPC
level: medium
