title: Potential GoToMyPC RMM Tool Registry Activity
id: 35de579a-2a25-4303-8a66-0f5f528d9124
status: experimental
description: |
    Detects potential registry activity of GoToMyPC RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: registry_event
detection:
    selection:
        TargetObject|contains:
            - "HKEY_LOCAL_MACHINE\WOW6432Node\Citrix\GoToMyPc"
            - "HKEY_LOCAL_MACHINE\WOW6432Node\Citrix\GoToMyPc\GuestInvite"
            - "HKEY_CURRENT_USER\SOFTWARE\Citrix\GoToMyPc\FileTransfer\history"
            - "HKEY_USERS\<SID>\SOFTWARE\Citrix\GoToMyPc\FileTransfer\history"
    condition: selection
falsepositives:
    - Legitimate use of GoToMyPC
level: medium
