title: Potential HeartbeatRM RMM Tool File Activity
id: 7720ab99-e18a-40a1-b177-9f68791e9ffa
status: experimental
description: |
    Detects potential files activity of HeartbeatRM RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: file_event
detection:
    selection:
        TargetFilename|endswith:
            - "C:\Program Files (x86)\HeartbeatRM\*"
            - "C:\Program Files\HeartbeatRM\*"
            - "*\agent-installer-any.exe"
    condition: selection
falsepositives:
    - Legitimate use of HeartbeatRM
level: medium
