title: Potential HelpBeam RMM Tool Network Activity
id: 295371ec-afc6-4c6e-ad4c-a01700328698
status: experimental
description: |
    Detects potential network activity of HelpBeam RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: network_connection
detection:
    selection:
        DestinationHostname|endswith: "helpbeam.software.informer.com"
    condition: selection
falsepositives:
    - Legitimate use of HelpBeam
level: medium
