title: Potential HelpU RMM Tool Network Activity
id: e44ae45e-0228-4e42-b1f9-35d38937f3e8
status: experimental
description: |
    Detects potential network activity of HelpU RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: network_connection
detection:
    selection:
        DestinationHostname|endswith:
            - "helpu.co.kr"
            - "*.helpu.co.kr"
    condition: selection
falsepositives:
    - Legitimate use of HelpU
level: medium
