title: Potential HopToDesk RMM Tool Network Activity
id: d3143867-0e13-4918-b9a6-a4409f33d7de
status: experimental
description: |
    Detects potential network activity of HopToDesk RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: network_connection
detection:
    selection:
        DestinationHostname|endswith:
            - "hoptodesk.com"
            - "api.hoptodesk.com"
            - "signal.hoptodesk.com"
            - "turn.hoptodesk.com"
            - "download.hoptodesk.com"
            - "www.hoptodesk.com"
    condition: selection
falsepositives:
    - Legitimate use of HopToDesk
level: medium
