title: Potential HopToDesk RMM Tool Process Activity
id: 8869b5aa-1a9e-4098-a0b4-01a3e9d3ade7
status: experimental
description: |
    Detects potential processes activity of HopToDesk RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: process_creation
detection:
    selection_parent:
        ParentImage|endswith:
            - "C:\Program Files (x86)\HopToDesk\HopToDesk.exe"
            - "HopToDesk.exe"
            - "HopToDesk-Standalone.exe"
    selection_image:
        Image|endswith:
            - "C:\Program Files (x86)\HopToDesk\HopToDesk.exe"
            - "HopToDesk.exe"
            - "HopToDesk-Standalone.exe"
    condition: 1 of selection_*
falsepositives:
    - Legitimate use of HopToDesk
level: medium
