title: Potential HopToDesk RMM Tool File Activity
id: 37099681-2fe5-4c48-9c8a-dead39d09bc1
status: experimental
description: |
    Detects potential files activity of HopToDesk RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: file_event
detection:
    selection:
        TargetFilename|endswith:
            - "C:\Program Files (x86)\HopToDesk\HopToDesk.exe"
            - "C:\Program Files (x86)\HopToDesk\privacyhelper.exe"
            - "C:\Program Files (x86)\HopToDesk\PrivacyMode.dll"
            - "C:\Program Files (x86)\HopToDesk\sciter.dll"
            - "C:\Users\*\AppData\Local\Temp\sciter.dll"
            - "C:\Users\*\AppData\Local\Temp\privacyhelper.exe"
            - "C:\Users\*\AppData\Roaming\HopToDesk\config\*"
            - "C:\Users\*\AppData\Roaming\HopToDesk\config\hoptodesk.toml"
            - "C:\Users\*\AppData\Roaming\HopToDesk\config\HopToDesk.toml"
            - "C:\Users\*\AppData\Roaming\HopToDesk\config\HopToDesk_rCURRENT.log"
            - "/System/Volumes/Data/Users/*/Library/Logs/HopToDesk/hoptodesk_rCURRENT.log"
    condition: selection
falsepositives:
    - Legitimate use of HopToDesk
level: medium
