title: Potential HopToDesk RMM Tool Registry Activity
id: 6ef0b3df-0c9a-4352-9085-d0741f6b3ea0
status: experimental
description: |
    Detects potential registry activity of HopToDesk RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: registry_event
detection:
    selection:
        TargetObject|contains:
            - "HKEY_CURRENT_USER\Software\Classes\HopToDesk\shell\open\command"
            - "HKEY_LOCAL_MACHINE\Software\Wow6432Node\Microsoft\Windows\CurrentVersion\Uninstall\HopToDesk"
    condition: selection
falsepositives:
    - Legitimate use of HopToDesk
level: medium
