title: Potential iDrive RMM Tool Registry Activity
id: b042e496-f23e-456c-a96f-a1d7e4799afe
status: experimental
description: |
    Detects potential registry activity of iDrive RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: registry_event
detection:
    selection:
        TargetObject|contains:
            - "HKEY_LOCAL_MACHINE\SOFTWARE\IDrive\*"
            - "HKEY_CURRENT_USER\SOFTWARE\IDrive\*"
    condition: selection
falsepositives:
    - Legitimate use of iDrive
level: medium
