title: Potential Kabuto RMM Tool Process Activity
id: ef240db1-6bd8-499e-b639-8bbd5268a9c9
status: experimental
description: |
    Detects potential processes activity of Kabuto RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: process_creation
detection:
    selection_parent:
        ParentImage|endswith: "Kabuto.App.Runner.exe"
    selection_image:
        Image|endswith: "Kabuto.App.Runner.exe"
    condition: 1 of selection_*
falsepositives:
    - Legitimate use of Kabuto
level: medium
