title: Potential KickIdler RMM Tool Network Activity
id: e0e86ba3-7a49-4a1c-92f1-cd49dad7e388
status: experimental
description: |
    Detects potential network activity of KickIdler RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: network_connection
detection:
    selection:
        DestinationHostname|endswith:
            - "kickidler.com"
            - "my.kickidler.com"
    condition: selection
falsepositives:
    - Legitimate use of KickIdler
level: medium
