title: Potential LabTech RMM (Now ConnectWise Automate) RMM Tool Process Activity
id: c4c25278-b0c5-4a61-8213-960371eea361
status: experimental
description: |
    Detects potential processes activity of LabTech RMM (Now ConnectWise Automate) RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: process_creation
detection:
    selection_parent:
        ParentImage|endswith:
            - "ltsvc.exe"
            - "ltsvcmon.exe"
            - "lttray.exe"
    selection_image:
        Image|endswith:
            - "ltsvc.exe"
            - "ltsvcmon.exe"
            - "lttray.exe"
    condition: 1 of selection_*
falsepositives:
    - Legitimate use of LabTech RMM (Now ConnectWise Automate)
level: medium
