title: Potential Level.io RMM Tool File Activity
id: 3a981905-05e9-4d81-8b86-54083ce07c65
status: experimental
description: |
    Detects potential files activity of Level.io RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: file_event
detection:
    selection:
        TargetFilename|endswith:
            - "C:\Program Files\Level\level.exe"
            - "C:\Program Files\Level\osqueryi.exe"
            - "C:\Program Files\Level\level.log"
    condition: selection
falsepositives:
    - Legitimate use of Level.io
level: medium
