title: Potential LiteManager RMM Tool Process Activity
id: 4ebd6463-07d2-45c1-af9e-9b29c1686b09
status: experimental
description: |
    Detects potential processes activity of LiteManager RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: process_creation
detection:
    selection_parent:
        ParentImage|endswith:
            - "lmnoipserver.exe"
            - "ROMFUSClient.exe"
            - "romfusclient.exe"
            - "romviewer.exe"
            - "romserver.exe"
            - "ROMServer.exe"
    selection_image:
        Image|endswith:
            - "lmnoipserver.exe"
            - "ROMFUSClient.exe"
            - "romfusclient.exe"
            - "romviewer.exe"
            - "romserver.exe"
            - "ROMServer.exe"
    condition: 1 of selection_*
falsepositives:
    - Legitimate use of LiteManager
level: medium
