title: Potential ManageEngine ServiceDesk Plus RMM Tool Registry Activity
id: 0a750ef8-625d-4c09-a8ef-87a873925549
status: experimental
description: |
    Detects potential registry activity of ManageEngine ServiceDesk Plus RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: registry_event
detection:
    selection:
        TargetObject|contains: "HKLM\SOFTWARE\WOW6432Node\Microsoft\Windows\CurrentVersion\Uninstall\{*}"
    condition: selection
falsepositives:
    - Legitimate use of ManageEngine ServiceDesk Plus
level: medium
