title: Potential MeshCentral RMM Tool File Activity
id: d026b7e7-0a87-4dc0-8364-b4aa38daa40f
status: experimental
description: |
    Detects potential files activity of MeshCentral RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: file_event
detection:
    selection:
        TargetFilename|endswith:
            - "C:\Program Files\Mesh Agent\MeshAgent.exe"
            - "C:\Program Files\Mesh Agent\MeshAgent.msh"
            - "/usr/local/mesh_services/meshagent/meshagent/meshagent"
            - "/usr/local/mesh_services/meshagent/meshagent/meshagent.db"
            - "/usr/local/mesh_services/meshagent/meshagent/meshagent.msh"
            - "/usr/local/mesh_services/meshagent/meshagent"
            - "/usr/local/mesh_services/meshagent/meshagent.db"
            - "/usr/local/mesh_services/meshagent/meshagent.msh"
    condition: selection
falsepositives:
    - Legitimate use of MeshCentral
level: medium
