title: Potential Mouse Without Borders RMM Tool File Activity
id: e6fcc1cd-eaa3-4d10-9ee6-8c42a3b1b847
status: experimental
description: |
    Detects potential files activity of Mouse Without Borders RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: file_event
detection:
    selection:
        TargetFilename|endswith:
            - "C:\Program Files (x86)\Microsoft Garage\Mouse without Borders\MouseWithoutBorders.exe"
            - "C:\Program Files (x86)\Microsoft Garage\Mouse without Borders\MouseWithoutBordersSvc.exe"
            - "C:\Program Files (x86)\Microsoft Garage\Mouse without Borders\MouseWithoutBordersHelper.exe"
    condition: selection
falsepositives:
    - Legitimate use of Mouse Without Borders
level: medium
