title: Potential mRemoteNG RMM Tool File Activity
id: 2ecf7c86-7255-4310-b48f-a95494d22ca0
status: experimental
description: |
    Detects potential files activity of mRemoteNG RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: file_event
detection:
    selection:
        TargetFilename|endswith:
            - "C:\Users\*\AppData\Roaming\mRemoteNG\mRemoteNG.log"
            - "C:\Users\*\AppData\Roaming\mRemoteNG\confCons.xml"
            - "C:\Users\*\AppData\*\mRemoteNG\**10\user.config"
    condition: selection
falsepositives:
    - Legitimate use of mRemoteNG
level: medium
