title: Potential MSP360 RMM Tool Process Activity
id: 5d340db8-bba9-4dd7-925b-d56abc207f9c
status: experimental
description: |
    Detects potential processes activity of MSP360 RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: process_creation
detection:
    selection_parent:
        ParentImage|endswith:
            - "Online Backup.exe"
            - "CBBackupPlan.exe"
            - "Cloud.Backup.Scheduler.exe"
            - "Cloud.Backup.RM.Service.exe"
            - "cbb.exe"
            - "CloudRaService.exe"
            - "CloudRaSd.exe"
            - "CloudRaCmd.exe"
            - "CloudRaUtilities.exe"
            - "Remote Desktop.exe"
            - "Connect.exe"
    selection_image:
        Image|endswith:
            - "Online Backup.exe"
            - "CBBackupPlan.exe"
            - "Cloud.Backup.Scheduler.exe"
            - "Cloud.Backup.RM.Service.exe"
            - "cbb.exe"
            - "CloudRaService.exe"
            - "CloudRaSd.exe"
            - "CloudRaCmd.exe"
            - "CloudRaUtilities.exe"
            - "Remote Desktop.exe"
            - "Connect.exe"
    condition: 1 of selection_*
falsepositives:
    - Legitimate use of MSP360
level: medium
