title: Potential mstsc RMM Tool Process Activity
id: a246b30b-2ed0-4301-a709-c76e48145137
status: experimental
description: |
    Detects potential processes activity of mstsc RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: process_creation
detection:
    selection_parent:
        ParentImage|endswith:
            - "C:\Windows\System32\mstsc.exe"
            - "*Windows\System32\mstsc.exe"
    selection_image:
        Image|endswith:
            - "C:\Windows\System32\mstsc.exe"
            - "*Windows\System32\mstsc.exe"
    condition: 1 of selection_*
falsepositives:
    - Legitimate use of mstsc
level: medium
