title: Potential NetBird RMM Tool Process Activity
id: daa19f94-3c2b-47a7-9c05-d5f7e9817e8c
status: experimental
description: |
    Detects potential processes activity of NetBird RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: process_creation
detection:
    selection_parent:
        ParentImage|endswith:
            - "C:\Program Files\Netbird\netbird.exe"
            - "C:\Program Files\Netbird\netbird-ui.exe"
            - "netbird.exe"
            - "netbird-ui.exe"
    selection_image:
        Image|endswith:
            - "C:\Program Files\Netbird\netbird.exe"
            - "C:\Program Files\Netbird\netbird-ui.exe"
            - "netbird.exe"
            - "netbird-ui.exe"
    condition: 1 of selection_*
falsepositives:
    - Legitimate use of NetBird
level: medium
