title: Potential NetBird RMM Tool File Activity
id: e5c0e88e-bad0-4a20-9fae-5c852008e39c
status: experimental
description: |
    Detects potential files activity of NetBird RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: file_event
detection:
    selection:
        TargetFilename|endswith:
            - "C:\Program Files\Netbird\netbird.exe"
            - "C:\ProgramData\Netbird\config.json"
            - "/etc/netbird/config.json"
            - "/var/log/netbird/*"
    condition: selection
falsepositives:
    - Legitimate use of NetBird
level: medium
