title: Potential NetLock RMM RMM Tool File Activity
id: 4eb2c5ae-a6d0-4dcf-9351-b06a715dc9fa
status: experimental
description: |
    Detects potential files activity of NetLock RMM RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: file_event
detection:
    selection:
        TargetFilename|endswith:
            - "C:\temp\netlock rmm\installer\logs\*"
            - "C:\ProgramData\0x101 Cyber Security\NetLock RMM\Comm Agent\server_config.json"
            - "/etc/systemd/system/netlock-rmm-agent-comm.service"
            - "/Library/LaunchDaemons/com.netlock.rmm.agentcomm.plist"
            - "/var/log/netlock-rmm-agent-comm.log"
    condition: selection
falsepositives:
    - Legitimate use of NetLock RMM
level: medium
