title: Potential NetLock RMM RMM Tool Process Activity
id: 2fada1ee-37f5-4f4a-9ce1-548ce4816bca
status: experimental
description: |
    Detects potential processes activity of NetLock RMM RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: process_creation
detection:
    selection_parent:
        ParentImage|endswith:
            - "NetLock_RMM_Agent_Installer.exe"
            - "C:\Program Files\0x101 Cyber Security\NetLock RMM\UserAgent\NetLock_RMM_User_Process.exe"
            - "C:\Program Files\0x101 Cyber Security\NetLock RMM\UserAgent\NetLock_RMM_User_UAC.exe"
    selection_image:
        Image|endswith:
            - "NetLock_RMM_Agent_Installer.exe"
            - "C:\Program Files\0x101 Cyber Security\NetLock RMM\UserAgent\NetLock_RMM_User_Process.exe"
            - "C:\Program Files\0x101 Cyber Security\NetLock RMM\UserAgent\NetLock_RMM_User_UAC.exe"
    condition: 1 of selection_*
falsepositives:
    - Legitimate use of NetLock RMM
level: medium
