title: Potential Netop Remote Control (aka Impero Connect) RMM Tool Network Activity
id: 41913bfc-35cd-4f68-bf6c-0abeefecf58d
status: experimental
description: |
    Detects potential network activity of Netop Remote Control (aka Impero Connect) RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: network_connection
detection:
    selection:
        DestinationHostname|endswith: "imperosoftware.com/impero-connect/"
    condition: selection
falsepositives:
    - Legitimate use of Netop Remote Control (aka Impero Connect)
level: medium
