title: Potential Netop Remote Control (Impero Connect) RMM Tool Network Activity
id: d4a46670-e2fe-4e21-8df4-15ff9846a6bd
status: experimental
description: |
    Detects potential network activity of Netop Remote Control (Impero Connect) RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: network_connection
detection:
    selection:
        DestinationHostname|endswith:
            - "*.connect.backdrop.cloud"
            - "*.netop.com"
    condition: selection
falsepositives:
    - Legitimate use of Netop Remote Control (Impero Connect)
level: medium
