title: Potential NetSupport Manager RMM Tool Process Activity
id: df0fffa7-376a-47ac-96d8-6aa840c1bf56
status: experimental
description: |
    Detects potential processes activity of NetSupport Manager RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: process_creation
detection:
    selection_parent:
        ParentImage|endswith:
            - "pcictlui.exe"
            - "pcicfgui.exe"
            - "client32.exe"
    selection_image:
        Image|endswith:
            - "pcictlui.exe"
            - "pcicfgui.exe"
            - "client32.exe"
    condition: 1 of selection_*
falsepositives:
    - Legitimate use of NetSupport Manager
level: medium
