title: Potential Netviewer RMM Tool Network Activity
id: 707f6671-bf8b-4aab-8a74-9036bc28fbfd
status: experimental
description: |
    Detects potential network activity of Netviewer RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: network_connection
detection:
    selection:
        DestinationHostname|endswith: "download.cnet.com/Net-Viewer/3000-2370_4-10034828.html"
    condition: selection
falsepositives:
    - Legitimate use of Netviewer
level: medium
