title: Potential NVDA (Non-Visual Desktop Access) RMM Tool Network Activity
id: 8ad92eff-97ab-4b5f-95bf-8900fac4fabe
status: experimental
description: |
    Detects potential network activity of NVDA (Non-Visual Desktop Access) RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: network_connection
detection:
    selection:
        DestinationHostname|endswith:
            - "nvaccess.org"
            - "*.nvaccess.org"
    condition: selection
falsepositives:
    - Legitimate use of NVDA (Non-Visual Desktop Access)
level: medium
