title: Potential Panorama9 RMM Tool Network Activity
id: 51871839-1573-4442-a522-f73d8228b442
status: experimental
description: |
    Detects potential network activity of Panorama9 RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: network_connection
detection:
    selection:
        DestinationHostname|endswith:
            - "trusted.panorama9.com"
            - "changes.panorama9.com"
            - "panorama9.com"
    condition: selection
falsepositives:
    - Legitimate use of Panorama9
level: medium
