title: Potential Parsec RMM Tool File Activity
id: 805f80a7-9ee1-4506-86ca-40e99d468ca7
status: experimental
description: |
    Detects potential files activity of Parsec RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: file_event
detection:
    selection:
        TargetFilename|endswith:
            - "C:\Program Files\Parsec\parsecd.exe"
            - "C:\Program Files\Parsec\pservice.exe"
            - "C:\Program Files\Parsec\teams.exe"
    condition: selection
falsepositives:
    - Legitimate use of Parsec
level: medium
