title: Potential PDQ Connect RMM Tool File Activity
id: 823c8633-0c13-4c45-becd-6fda56076a3e
status: experimental
description: |
    Detects potential files activity of PDQ Connect RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: file_event
detection:
    selection:
        TargetFilename|endswith: "C:\ProgramData\PDQ\PDQConnectAgent\PDQConnectAgent.db-journal"
    condition: selection
falsepositives:
    - Legitimate use of PDQ Connect
level: medium
