title: Potential Pulseway RMM Tool Network Activity
id: 1ebf7f89-517c-42be-b5f9-fd2eaf804815
status: experimental
description: |
    Detects potential network activity of Pulseway RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: network_connection
detection:
    selection:
        DestinationHostname|endswith: "pulseway.com"
    condition: selection
falsepositives:
    - Legitimate use of Pulseway
level: medium
