title: Potential Quick Assist RMM Tool Network Activity
id: 5940dd19-ba5b-4b96-9e28-3ffee8e91bde
status: experimental
description: |
    Detects potential network activity of Quick Assist RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: network_connection
detection:
    selection:
        DestinationHostname|endswith: "*.support.services.microsoft.com"
    condition: selection
falsepositives:
    - Legitimate use of Quick Assist
level: medium
