title: Potential RAdmin RMM Tool Process Activity
id: 5162a90f-e322-44ba-a3b3-f91b2e68f2c1
status: experimental
description: |
    Detects potential processes activity of RAdmin RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: process_creation
detection:
    selection_parent:
        ParentImage|endswith:
            - "C:\Program Files (x86)\Radmin Viewer 3\Radmin.exe"
            - "C:\Windows\SysWOW64\rserver30\rserver3.exe"
    selection_image:
        Image|endswith:
            - "C:\Program Files (x86)\Radmin Viewer 3\Radmin.exe"
            - "C:\Windows\SysWOW64\rserver30\rserver3.exe"
    condition: 1 of selection_*
falsepositives:
    - Legitimate use of RAdmin
level: medium
