title: Potential RAdmin RMM Tool File Activity
id: 207e209a-4807-4339-aaa1-43f41e83f305
status: experimental
description: |
    Detects potential files activity of RAdmin RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: file_event
detection:
    selection:
        TargetFilename|endswith:
            - "C:\Windows\SysWOW64\rserver30\Radm_log.htm"
            - "C:\Windows\System32\rserver30\Radm_log.htm"
            - "C:\Windows\System32\rserver30\CHATLOGS\*\*.htm"
            - "C:\Users\*\Documents\ChatLogs\*\*.htm"
    condition: selection
falsepositives:
    - Legitimate use of RAdmin
level: medium
