title: Potential Rapid7 RMM Tool Process Activity
id: ee28b672-73dc-4b3e-9752-2a420426f6f2
status: experimental
description: |
    Detects potential processes activity of Rapid7 RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: process_creation
detection:
    selection_parent:
        ParentImage|endswith:
            - "ir_agent.exe"
            - "rapid7_agent_core.exe"
            - "rapid7_endpoint_broker.exe"
    selection_image:
        Image|endswith:
            - "ir_agent.exe"
            - "rapid7_agent_core.exe"
            - "rapid7_endpoint_broker.exe"
    condition: 1 of selection_*
falsepositives:
    - Legitimate use of Rapid7
level: medium
