title: Potential RdClient RMM Tool Registry Activity
id: f9c34442-e2e9-4b21-978a-83544fd64814
status: experimental
description: |
    Detects potential registry activity of RdClient RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: registry_event
detection:
    selection:
        TargetObject|contains: "HKLM\SOFTWARE\RdClient"
    condition: selection
falsepositives:
    - Legitimate use of RdClient
level: medium
