title: Potential RDPView RMM Tool Network Activity
id: 57992890-6799-4c08-9ff4-6dc555304f35
status: experimental
description: |
    Detects potential network activity of RDPView RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: network_connection
detection:
    selection:
        DestinationHostname|endswith:
            - "user_managed"
            - "systemmanager.ru/dntu.en/rdp_view.htm"
    condition: selection
falsepositives:
    - Legitimate use of RDPView
level: medium
