title: Potential RemotePass RMM Tool Process Activity
id: a15620b2-aa22-4914-a1e9-d7ecac53dd23
status: experimental
description: |
    Detects potential processes activity of RemotePass RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: process_creation
detection:
    selection_parent:
        ParentImage|endswith:
            - "remotepass-access.exe"
            - "rpaccess.exe"
            - "rpwhostscr.exe"
    selection_image:
        Image|endswith:
            - "remotepass-access.exe"
            - "rpaccess.exe"
            - "rpwhostscr.exe"
    condition: 1 of selection_*
falsepositives:
    - Legitimate use of RemotePass
level: medium
