title: Potential Remote Utilities RMM Tool Process Activity
id: 525617a8-930d-4a1e-a987-c63755ea8c5a
status: experimental
description: |
    Detects potential processes activity of Remote Utilities RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: process_creation
detection:
    selection_parent:
        ParentImage|endswith:
            - "rutview.exe"
            - "rutserv.exe"
    selection_image:
        Image|endswith:
            - "rutview.exe"
            - "rutserv.exe"
    condition: 1 of selection_*
falsepositives:
    - Legitimate use of Remote Utilities
level: medium
