title: Potential Remote.it RMM Tool Process Activity
id: a8651ad4-8c82-4660-ba48-61a417914219
status: experimental
description: |
    Detects potential processes activity of Remote.it RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: process_creation
detection:
    selection_parent:
        ParentImage|endswith:
            - "remote-it-installer.exe"
            - "remote.it.exe"
            - "remoteit.exe"
    selection_image:
        Image|endswith:
            - "remote-it-installer.exe"
            - "remote.it.exe"
            - "remoteit.exe"
    condition: 1 of selection_*
falsepositives:
    - Legitimate use of Remote.it
level: medium
