title: Potential RustDesk RMM Tool Process Activity
id: df331272-6d87-458c-bfc8-5ccf8e3f2a4b
status: experimental
description: |
    Detects potential processes activity of RustDesk RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: process_creation
detection:
    selection_parent:
        ParentImage|endswith:
            - "rustdesk*.exe"
            - "rustdesk.exe"
            - "C:\Users\*\AppData\Local\rustdesk\rustdesk.exe"
    selection_image:
        Image|endswith:
            - "rustdesk*.exe"
            - "rustdesk.exe"
            - "C:\Users\*\AppData\Local\rustdesk\rustdesk.exe"
    condition: 1 of selection_*
falsepositives:
    - Legitimate use of RustDesk
level: medium
