title: Potential RustDesk RMM Tool File Activity
id: 30e48a3b-aff6-4df3-a8b7-bb8f91642c97
status: experimental
description: |
    Detects potential files activity of RustDesk RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: file_event
detection:
    selection:
        TargetFilename|endswith: "C:\Windows\ServiceProfiles\LocalService\AppData\Roaming\RustDesk\*"
    condition: selection
falsepositives:
    - Legitimate use of RustDesk
level: medium
