title: Potential ScreenConnect RMM Tool File Activity
id: 65059f62-0123-4b3e-a8e3-88eb92c0791d
status: experimental
description: |
    Detects potential files activity of ScreenConnect RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: file_event
detection:
    selection:
        TargetFilename|endswith:
            - "C:\Program Files*\ScreenConnect\App_Data\Session.db"
            - "C:\Program Files*\ScreenConnect\App_Data\User.xml"
            - "C:\ProgramData\ScreenConnect Client*\user.config"
    condition: selection
falsepositives:
    - Legitimate use of ScreenConnect
level: medium
