title: Potential SecureCRT RMM Tool Process Activity
id: 7f82d0de-7f1b-40cc-af22-feb94b83620c
status: experimental
description: |
    Detects potential processes activity of SecureCRT RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: process_creation
detection:
    selection_parent:
        ParentImage|endswith:
            - "C:\*\SecureCRT.EXE"
            - "*\SecureCRT.EXE"
    selection_image:
        Image|endswith:
            - "C:\*\SecureCRT.EXE"
            - "*\SecureCRT.EXE"
    condition: 1 of selection_*
falsepositives:
    - Legitimate use of SecureCRT
level: medium
