title: Potential ShowMyPC RMM Tool Network Activity
id: 64d73b81-7f64-4c60-92aa-b6c9f3a7b473
status: experimental
description: |
    Detects potential network activity of ShowMyPC RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: network_connection
detection:
    selection:
        DestinationHostname|endswith:
            - "*.showmypc.com"
            - "showmypc.com"
    condition: selection
falsepositives:
    - Legitimate use of ShowMyPC
level: medium
