title: Potential Sophos-Remote Management System RMM Tool Process Activity
id: 235f30f3-9086-4404-b34e-b7dcde3d04df
status: experimental
description: |
    Detects potential processes activity of Sophos-Remote Management System RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: process_creation
detection:
    selection_parent:
        ParentImage|endswith:
            - "clientmrinit.exe"
            - "mgntsvc.exe"
            - "routernt.exe"
    selection_image:
        Image|endswith:
            - "clientmrinit.exe"
            - "mgntsvc.exe"
            - "routernt.exe"
    condition: 1 of selection_*
falsepositives:
    - Legitimate use of Sophos-Remote Management System
level: medium
