title: Potential Splashtop (Beta) RMM Tool Process Activity
id: ef3a09c3-bc96-4c25-84e8-7d1b54a11750
status: experimental
description: |
    Detects potential processes activity of Splashtop (Beta) RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: process_creation
detection:
    selection_parent:
        ParentImage|endswith:
            - "SRServer.exe"
            - "SplashtopSOS.exe"
            - "Splashtop_Streamer_Windows*.exe"
            - "SRManager.exe"
    selection_image:
        Image|endswith:
            - "SRServer.exe"
            - "SplashtopSOS.exe"
            - "Splashtop_Streamer_Windows*.exe"
            - "SRManager.exe"
    condition: 1 of selection_*
falsepositives:
    - Legitimate use of Splashtop (Beta)
level: medium
