title: Potential SunLogin RMM Tool Process Activity
id: 21b6dd8f-c77c-4e92-ac6d-134fedd8b5e0
status: experimental
description: |
    Detects potential processes activity of SunLogin RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: process_creation
detection:
    selection_parent:
        ParentImage|endswith:
            - "OrayRemoteShell.exe"
            - "OrayRemoteService.exe"
            - "sunlogin*.exe"
    selection_image:
        Image|endswith:
            - "OrayRemoteShell.exe"
            - "OrayRemoteService.exe"
            - "sunlogin*.exe"
    condition: 1 of selection_*
falsepositives:
    - Legitimate use of SunLogin
level: medium
