title: Potential SuperOps RMM Tool Process Activity
id: 7ad01066-0768-4abb-8773-12bc360cbd87
status: experimental
description: |
    Detects potential processes activity of SuperOps RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: process_creation
detection:
    selection_parent:
        ParentImage|endswith:
            - "superopsticket.exe"
            - "superops.exe"
    selection_image:
        Image|endswith:
            - "superopsticket.exe"
            - "superops.exe"
    condition: 1 of selection_*
falsepositives:
    - Legitimate use of SuperOps
level: medium
