title: Potential Tailscale RMM Tool Network Activity
id: 5341600f-6e56-4fbd-8527-b4e05e6e178b
status: experimental
description: |
    Detects potential network activity of Tailscale RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: network_connection
detection:
    selection:
        DestinationHostname|endswith:
            - "*.tailscale.com"
            - "*.tailscale.io"
            - "tailscale.com"
    condition: selection
falsepositives:
    - Legitimate use of Tailscale
level: medium
