title: Potential Tanium RMM Tool Process Activity
id: 60824f59-8a05-4daf-9e5c-aa0ac87ca085
status: experimental
description: |
    Detects potential processes activity of Tanium RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: process_creation
detection:
    selection_parent:
        ParentImage|endswith:
            - "TaniumClient.exe"
            - "TaniumCX.exe"
            - "TaniumExecWrapper.exe"
            - "TaniumFileInfo.exe"
            - "TPowerShell.exe"
    selection_image:
        Image|endswith:
            - "TaniumClient.exe"
            - "TaniumCX.exe"
            - "TaniumExecWrapper.exe"
            - "TaniumFileInfo.exe"
            - "TPowerShell.exe"
    condition: 1 of selection_*
falsepositives:
    - Legitimate use of Tanium
level: medium
