title: Potential Veyon RMM Tool Registry Activity
id: b7a72ac1-c517-434a-8f62-6d304614684c
status: experimental
description: |
    Detects potential registry activity of Veyon RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: registry_event
detection:
    selection:
        TargetObject|contains:
            - "HKLM\SOFTWARE\Veyon Solutions"
            - "HKLM\SYSTEM\CurrentControlSet\Services\VeyonService"
    condition: selection
falsepositives:
    - Legitimate use of Veyon
level: medium
