title: Potential WebRDP RMM Tool Process Activity
id: 49564198-ad3c-49c9-a9ee-37f746e8c406
status: experimental
description: |
    Detects potential processes activity of WebRDP RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: process_creation
detection:
    selection_parent:
        ParentImage|endswith: "webrdp.exe"
    selection_image:
        Image|endswith: "webrdp.exe"
    condition: 1 of selection_*
falsepositives:
    - Legitimate use of WebRDP
level: medium
