title: Potential ZeroTier RMM Tool Process Activity
id: 5299a5f6-e999-4d73-a574-f39f251ffbc1
status: experimental
description: |
    Detects potential processes activity of ZeroTier RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: process_creation
detection:
    selection_parent:
        ParentImage|endswith:
            - "zerotier*.exe"
            - "zero-powershell.exe"
    selection_image:
        Image|endswith:
            - "zerotier*.exe"
            - "zero-powershell.exe"
    condition: 1 of selection_*
falsepositives:
    - Legitimate use of ZeroTier
level: medium
