title: Potential Zoho Assist RMM Tool Process Activity
id: 916aeebd-3605-4f90-ad79-481a21c2cfbe
status: experimental
description: |
    Detects potential processes activity of Zoho Assist RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: process_creation
detection:
    selection_parent:
        ParentImage|endswith:
            - "zaservice.exe"
            - "ZMAgent.exe"
            - "C:\*\ZA_Access.exe"
            - "ZohoMeeting.exe"
            - "Zohours.exe"
            - "zohotray.exe"
            - "ZohoURSService.exe"
            - "*\ZA_Access.exe"
            - "Zaservice.exe"
            - "za_connect.exe"
            - "connect.exe"
    selection_image:
        Image|endswith:
            - "zaservice.exe"
            - "ZMAgent.exe"
            - "C:\*\ZA_Access.exe"
            - "ZohoMeeting.exe"
            - "Zohours.exe"
            - "zohotray.exe"
            - "ZohoURSService.exe"
            - "*\ZA_Access.exe"
            - "Zaservice.exe"
            - "za_connect.exe"
            - "connect.exe"
    condition: 1 of selection_*
falsepositives:
    - Legitimate use of Zoho Assist
level: medium
